{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"7ec86874-73c8-5fb1-b81b-a8c358c8c6a6","excerpt":"I wanted to write a quick post about how I’m structuring my projects recently. I develop in  Sass , so this is what this article will focus…","html":"<p>I wanted to write a quick post about how I’m structuring my projects recently. I develop in <a href=\"http://Sass-lang.com\" title=\"Sass, CSS preprocessor\">Sass</a>, so this is what this article will focus on, but the core can be applied to any preprocessor or even sites using basic CSS. (gasp!)</p>\n<h3>Folder Structure</h3>\n<p>The first thing I set up for each project is obviously the folder structure. Lately I’ve been developing in <a href=\"http://laravel.com\" title=\"Laravel, PHP framework\">Laravel</a>, <a href=\"http://jekyllrb.com\" title=\"Jekyll\">Jekyll</a>, and <a href=\"http://drupal.org\" title=\"Drupal CMS\">Drupal</a>, and they each have unique theming requirements, but it basically boils down to creating a theme ‘assets’ folder. This assets folder will hold all theme based assets - Sass, CSS, images, fonts, javascripts, etc - and will contain your frameworks and js libraries, etc. You can place this folder inside a Drupal theme, the Laravel public folder, or the Jekyll root folder. Placing the ‘asset’ folder in the root is also how you would approach a normal .html site as well.\n{% highlight css linenos %}…\n/assets\n/Sass\n/cavern\n/ui\n<em>vars.sass\nscreen.sass\n/css\nscreen.css\n/images\nlogo.png\n/js\nscripts.js\n/fonts\nLocal</em>Font.tiff\nindex.html (php/etc..)\n…{% endhighlight %}</p>\n<p>If you’re using compass, you’ll want to track this ‘assets’ folder. The config.rb file will get installed inside of it as well. What this allows you to do is also create a repo just for your sites theme assets. I often create them as submodules of my framework repo (Drupal, Larvel etc). I find this allows me to easily update my themes submodules as well as segment my front-end assets from my back-end ones.</p>\n<p>I’ll have more Sass, compass, and front-end architecture posts coming soon.</p>\n<p>Stay tuned!</p>","frontmatter":{"title":"How to structure your next Sass project","date":"2013-12-22 12:00:00 +0200"}}},"pageContext":{"slug":"/blog/2013/12/22/2013-12-22-how-to-structure-your-next-sass-project/","previous":{"fields":{"slug":"/blog/2013/12/17/2013-12-17-first-jekyll-post/"},"frontmatter":{"title":"First Jekyll Post"}},"next":{"fields":{"slug":"/blog/2013/12/27/2013-12-27-defining-your-content-views/"},"frontmatter":{"title":"Defining your content views"}}}}