{"data":{"site":{"siteMetadata":{"title":"Gatsby Starter Blog","author":"Kyle Mathews"}},"markdownRemark":{"id":"983264cd-fedd-55c0-a905-32bf925db025","excerpt":"I’ve packaged up my personal custom Drupal theme,  Gotham , the same one I use on all my projects!  Gotham  is a theme that provides very…","html":"<p>I’ve packaged up my personal custom Drupal theme, <strong>Gotham</strong>, the same one I use on all my projects! <strong>Gotham</strong> is a theme that provides very little, it’s a modern shell built on top of the Classy theme in core. If your front-end stack includes <a href=\"http://sass-lang.com/\">Sass</a>, <a href=\"http://susy.oddbird.net/\">Susy</a>, and <a href=\"http://gulpjs.com/\">Gulp</a> Gotham is for you! It does very little out of the box but provide the foundation to build a modern theme.</p>\n<p>You can download the theme from <a href=\"https://www.drupal.org/sandbox/drewbolles/2645524\">drupal.org</a> or <a href=\"https://github.com/drewbolles/gotham/tree/8.x-1.x\">GitHub</a>. Install as normal, inside the <code class=\"language-text\">/themes</code> folder. The README will provide instructions on getting up and running, it should be rather straight forward. Running the Gulp build process will watch your Sass files. If you’d like to add anything to the gulpfile, feel empowered! This is simply a starting point, meant to be heavily customized.</p>\n<p>It leverages the <a href=\"https://smacss.com/\">SMACSS</a> folder architecture, and tries to keep the dependencies to a minimum. I often add image minifying, an SVG icon system, and a JS linter to my build process, but I didn’t want to add these by default. I’m very against over-opinionated foundations, and wanted to keep Gotham as nimble as possible.</p>\n<p>Pull requests welcome!</p>","frontmatter":{"title":"Introducing Gotham, a Drupal 8 starter theme","date":"Invalid date"}}},"pageContext":{"slug":"/blog/NaN/NaN/NaN/introducing-gotham-drupal-8-starter-theme/","previous":{"fields":{"slug":"/blog/NaN/NaN/NaN/printing-entity-reference-field-programmatically-drupal-8/"},"frontmatter":{"title":"Printing an Entity Reference field programmatically in Drupal 8"}},"next":{"fields":{"slug":"/blog/NaN/NaN/NaN/better-hero-banners-with-entities-drupal-8/"},"frontmatter":{"title":"Create better hero banners using entities in Drupal 8"}}}}